ceccaMatte/segna-punti-BLE-Esp32c6/sdkconfig.defaults
# Playmaker wearable - ESP32-C3 / ESP-IDF
CONFIG_IDF_TARGET="esp32c3"
CONFIG_IDF_TARGET_ESP32C3=y

# Flying prototype: GPIO20 is reserved as input and GPIO21 is held LOW.
# Keep the console on the native USB Serial/JTAG interface so UART0 pins are
# not needed for logging. The unmounted buzzer is reserved on GPIO5.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_NVS_ENCRYPTION=n


# The Wi-Fi/HTTP configuration UI pushes the firmware beyond the ESP-IDF
# default 1 MiB factory partition. ESP32-C3 SuperMini uses 4 MiB flash.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
